#Создайте словарь который содержит в себе все типы данных которые мы проходили (ключи на ваше усмотрение)')
list1=[1,2.2,'ghjkk']
list2=[1,3,5]
list3={'home':'дом'}
dictionary={
    'int':12,
    'fload':2.3,
    'str':"hello",
    'list': list1,
    'for':list2,
    'bool':True or False,
    'dict':list3
}

print(dictionary)
for i in dictionary:
    print(i)